{
  "embeds": [
    {
      "title": "Welcome to the Prism Launcher Discord server!",
      "description": "Prism Launcher is a free and open source Minecraft launcher with the ability to manage multiple instances, accounts, and mods, focused on user freedom and free redistributability.",
      "url": "https://prismlauncher.org/",
      "hex_color": "dfdfdf",
      "image": "https://cdn.discordapp.com/attachments/1031663678979838103/1033124128141607003/prism-background.jpg"
    }
  ],
  "messages": [
    "## Rules",
    "1. **Follow Discord's rules** - These include the [Community Guidelines](<https://discord.com/guidelines>) and the [Terms of Service](<https://discord.com/terms>).",
    "2. **Follow our Code of Conduct** - The [Code of Conduct](<https://github.com/PrismLauncher/PrismLauncher/blob/develop/CODE_OF_CONDUCT.md>) applies not only on GitHub but in all Prism Launcher community spaces. Those who do not intend to follow the Code of Conduct should not interact in Prism spaces.",
    "3. **Use English** - The common language in our community is English, but we understand that not everyone speaks English at the same level. Try to speak English to the best of your ability, and don't worry if you need to use translation tools. We will not tolerate making fun of people for poor English.",
    "4. **Listen to and respect all community team members** - Please take requests from community team members seriously and listen when one asks you to do something. If you have a problem with what a team member is asking you to do, we advise that you step away from the situation and send a private message to another team member.",
    "5. **Do not harass anyone** - We want to make participation in our community a harassment-free experience for everyone. If you think that someone is breaking the rules, contact the moderators, instead of harassing them. We will also not tolerate bashing on the developers of other launchers, including those which we have forked from.",
    "6. **Keep all activity legal, legitimate, and appropriate** - We do not tolerate users breaking any laws, breaching a ToS or an EULA, posting sexual content, or anything the moderators determine to be malicious or inappropriate. Shilling crypto currency related products and gambling websites is strictly forbidden.",
    "7. **Follow the given channel topic** - Don't derail a discussion, and don't start conversations outside of the channel in which they're most appropriate. For example, if you start to get off-topic in an on-topic channel, ask other participants to move to an off-topic channel. Advertisements are not allowed outside of showcase channels.",
    "8. **Don't import drama or controversy from other communities** - In these topics, emotions run high and opinions run even higher. To avoid arguments and other similar problems, simply avoid discussion of controversial topics from other communities.",
    "9. **Do not misuse accessibility tools** - PluralKit is here as aid for self identification purposes. Role-playing with PluralKit is not allowed.",
    "10. **Do not ping staff members for support requests** - Our moderators are not supporters! All support is done voluntarily. People might not know how to fix your problem, if no one has responded to your request for a long time.",
    "## Links",
    "- [Website](<https://prismlauncher.org/>)\n- [Wiki](<https://prismlauncher.org/wiki>)\n- [Source Code](<https://github.com/PrismLauncher>)\n- [Support Us](<https://opencollective.com/prismlauncher>)\n- [Subreddit](<https://reddit.com/r/PrismLauncher>)\n- [Twitter](<https://twitter.com/PrismLauncher>)\n- [Mastodon](<https://floss.social/@PrismLauncher>)\n\nDiscord Invite: <https://prismlauncher.org/discord>\n"
  ],
  "roles": [
    {
      "title": "Contributor Roles",
      "description": "Only select these if you have made a contribution to Prism Launcher!",
      "roles": [
        {
          "title": "Contributor",
          "id": 1031856922128830475,
          "emoji": "🧑‍💻"
        },
        {
          "title": "Design",
          "id": 1031856797570572329,
          "emoji": "🎨"
        },
        {
          "title": "Packager",
          "id": 1031845074847416352,
          "emoji": "📦"
        },
        {
          "title": "Translator",
          "id": 1072593656256659520,
          "emoji": "💬"
        },
        {
          "title": "Documentation",
          "id": 1031856744239996928,
          "emoji": "📚"
        }
      ]
    },
    {
      "title": "Cosmetic Roles",
      "description": "Choose an icon next to your name.",
      "roles": [
        {
          "title": "Trans Rights",
          "id": 1032829153961054230,
          "emoji": "🏳️‍⚧️"
        },
        {
          "title": "Programmer Socks",
          "id": 1032568692040548373,
          "emoji": "<:programmer_socks:1033131933464539146>"
        },
        {
          "title": "Blobfox Fanatic",
          "id": 1037726911616536577,
          "emoji": "<:blobfox:1037727909630201857>"
        },
        {
          "title": "Catquake Catquake",
          "id": 1041912460803842168,
          "emoji": "<:catquake:1039218794528247888>"
        }
      ]
    }
  ]
}
